{
    "articles": [
        {
            "author": "Anupama Ghosh",
            "title": "Markets edge higher ahead of Budget, Gold hits record on trade tariff concerns",
            "description": "Sensex opened higher at 76,888.89 and is currently trading at 77,006.86, up by 247.05 points; Nifty opened at 23,296.75 gaining 101.10 points",
            "url": "https://www.thehindubusinessline.com/markets/markets-edge-higher-ahead-of-budget-gold-hits-record-on-trade-tariff-concerns/article69162458.ece",
            "urlToImage": "https://bl-i.thgim.com/public/incoming/sma653/article69153960.ece/alternates/LANDSCAPE_1200/IMG_PO29_Business_graph_2_1_NGDD2126.jpg",
            "publishedAt": "2025-01-31T04:47:51Z",
            "content": "Indian equity markets opened higher on Thursday, with both benchmark indices extending gains for the third consecutive session amid cautious trading ahead of the Union Budget 2025. \r\nThe Sensex opene… [+3008 chars]"
        },
        {
            "author": "feedfeeder",
            "title": "The Dow jumps 250 points on strong tech earnings. Apple is up next - Quartz",
            "description": "The Dow jumps 250 points on strong tech earnings. Apple is up nextQuartz Stock market today: Dow, S&P 500, Nasdaq move higher with Apple earnings in the wingsYahoo Finance Stocks gain as Meta, Tesla boost investor mood; gold hits recordReuters S&P 500 rises b…",
            "url": "https://slashdot.org/firehose.pl?op=view&amp;id=176087143",
            "urlToImage": null,
            "publishedAt": "2025-01-31T02:12:55Z",
            "content": "There are three kinds of people: men, women, and unix."
        },
        {
            "author": "Reuters",
            "title": "US retail investors dive into tech stocks in response to DeepSeek selloff",
            "description": "Retail investors took advantage of the market selloff earlier this week by buying various technology stocks, including Nvidia, Tesla, Broadcom, and Apple, according to Vanda Research. This surge of investment, fueled by the recent decline in stock prices, led…",
            "url": "https://economictimes.indiatimes.com/markets/stocks/news/us-retail-investors-dive-into-tech-stocks-in-response-to-deepseek-selloff/articleshow/117764777.cms",
            "urlToImage": "https://img.etimg.com/thumb/msid-117764790,width-1200,height-630,imgsize-102258,overlay-etmarkets/articleshow.jpg",
            "publishedAt": "2025-01-31T02:05:55Z",
            "content": "(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets… [+301 chars]"
        }

    ]
}